In [1]:
import pandas as pd

In [2]:
file_name = "https://people.sc.fsu.edu/~jburkardt/data/csv/homes.csv"
df = pd.read_csv(file_name)

In [3]:
df.head()

,Sell,"""List""","""Living""","""Rooms""","""Beds""","""Baths""","""Age""","""Acres""","""Taxes"""
0,142,160,28,10,5,3,60,0.28,3167
1,175,180,18,8,4,1,12,0.43,4033
2,129,132,13,6,3,1,41,0.33,1471
3,138,140,17,7,3,1,22,0.46,3204
4,232,240,25,8,4,3,5,2.05,3613

In [4]:
# Use the string replace function through a lambda function on each column
df = df.rename(columns=lambda x: x.replace('"', ''))

In [5]:
df.head()

   Sell   List   Living   Rooms   Beds   Baths   Age   Acres   Taxes
0   142    160       28      10      5       3    60    0.28    3167
1   175    180       18       8      4       1    12    0.43    4033
2   129    132       13       6      3       1    41    0.33    1471
3   138    140       17       7      3       1    22    0.46    3204
4   232    240       25       8      4       3     5    2.05    3613

In [6]:
file_name = "https://people.sc.fsu.edu/~jburkardt/data/csv/homes.csv"
df = pd.read_csv(file_name)

In [7]:
df.head()

,Sell,"""List""","""Living""","""Rooms""","""Beds""","""Baths""","""Age""","""Acres""","""Taxes"""
0,142,160,28,10,5,3,60,0.28,3167
1,175,180,18,8,4,1,12,0.43,4033
2,129,132,13,6,3,1,41,0.33,1471
3,138,140,17,7,3,1,22,0.46,3204
4,232,240,25,8,4,3,5,2.05,3613

In [8]:
df.columns

Index(['Sell', ' "List"', ' "Living"', ' "Rooms"', ' "Beds"', ' "Baths"',
       ' "Age"', ' "Acres"', ' "Taxes"'],
      dtype='object')

In [9]:
df.columns = ['Sell', 'List', 'Living', 'Rooms', 'Beds', 'Baths',
       'Age', 'Acres', ' Taxes']

In [10]:
df.head()

   Sell  List  Living  Rooms  Beds  Baths  Age  Acres   Taxes
0   142   160      28     10     5      3   60   0.28    3167
1   175   180      18      8     4      1   12   0.43    4033
2   129   132      13      6     3      1   41   0.33    1471
3   138   140      17      7     3      1   22   0.46    3204
4   232   240      25      8     4      3    5   2.05    3613

In [11]:
df.columns = [col.strip(' ').strip('"') for col in df.columns]

In [12]:
df.columns

Index(['Sell', 'List', 'Living', 'Rooms', 'Beds', 'Baths', 'Age', 'Acres',
       'Taxes'],
      dtype='object')

In [13]:
df['new'] = df['Beds']/df['Taxes']

In [14]:
df = df.rename(columns={'new':'New'})

In [15]:
df.head()

   Sell  List  Living  Rooms  Beds  Baths  Age  Acres  Taxes       New
0   142   160      28     10     5      3   60   0.28   3167  0.001579
1   175   180      18      8     4      1   12   0.43   4033  0.000992
2   129   132      13      6     3      1   41   0.33   1471  0.002039
3   138   140      17      7     3      1   22   0.46   3204  0.000936
4   232   240      25      8     4      3    5   2.05   3613  0.001107